// 1.- Користувач вводить або має два числа. Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.
//
// let  x = prompt('Введіть перше число')
// let  y = prompt('Введіть друге число')
// if (x>y){
//     console.log('Більшим числом є :'+ x)}
//     else if (y>x){
//     console.log('Більшим числом є :'+ y)
// }    else if(x===y){
//         console.log(x +' є рівним ' +y )
// }

// 2. - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let z = +prompt('Введіть номер квартири')
//
// if (z > 0 && z <= 20){
// console.log('Ваша квартира знаходиться у першому підїзді')
// }
// else if (z > 20 && z <= 48){
//     console.log('Ваша квартира знаходиться у другому підїзді')
// }
// else if (z > 48 && z <= 90){
//     console.log('Ваша квартира знаходиться у третьому підїзді')
// } else {
//     console.log('У цьому будинку квартири від 1 до 90. ')
// }

// 3.- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть число 10')
//
// if (number ===10){
// console.log('Вірно')
// }else {
//     console.log('Невірно')
// }

// 4.- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = 20>21
//
// if (typeof x==='number'){
//     console.log('1')
// } else if (typeof x==='string') {
//     console.log('2')
// }
//  else if (typeof x==='boolean'){
//     console.log('3')
//
// } else if (typeof x==='object'){
//     console.log('4')
// } else {
//     console.log('Введіть вірне значення')
// }

// 5.- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let weather = prompt('Введіть значення температури')
//
// if (weather >= 10 && weather < 23){
//     console.log('Температура задовільна , ми йдемо вчитися')
// }else {
//     console.log('Сидимо дома й вчимось онлайн')
// }

// 6. - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let i = prompt('Щоб виграти приз введіть число (від 1 до 5) ');
// switch (i){
//     case '1':
//         console.log('Вітаю ! Ваш приз BMW');
//         break;
//     case '2':
//         console.log('Вітаю ! Ваш приз Iphone X ');
//         break;
//     case '3':
//         console.log('Вітаю ! Ваш приз MacBook ');
//         break;
//     case '4':
//         console.log('Вітаю ! Ваш приз Bugatti ');
//         break;
//     case '5':
//         console.log('Вітаю ! Ваш приз поїздка у Європу ');
//         break;
//     default:
//         console.log('Число не вірне')
// }